{
    "RELOAD_SCRIPT": "Recargar script",
    "DONATE": "Donar",
    "FEEDBACK": "Comentarios",
    "NEW_TAB": "Abrir en una nueva pestaña",
    "SHOW_DOM_TREE": "Mostrar árbol DOM",
    "SELECT_AND_COPY": "Seleccionar todo y copiar desde el cuadro de entrada",
    "DOWNLOAD_DOM_TREE": "Descargar árbol DOM como archivo de texto",
    "REPORT_GITHUB": "Informar un problema en GitHub",
    "REPORT_DISCORD": "Informar un problema en el servidor de soporte de Discord",
    "REPORT_FORK": "Informar un problema en Greasy Fork",
    "DEBUG": "Ventana de depuración",
    "CLOSE": "Cerrar",
    "ALL_CHECK": "Seleccionar todo",
    "BATCH_DOWNLOAD_SELECTED": "Descargar recursos seleccionados",
    "BATCH_DOWNLOAD_DIRECT": "Descargar todos los recursos",
    "IMG": "Imagen",
    "VID": "Video",
    "DW": "Descargar",
    "THUMBNAIL_INTRO": "Descargar miniatura de video",
    "LOAD_BLOB_ONE": "Cargando contenido multimedia en Blob...",
    "LOAD_BLOB_MULTIPLE": "Cargando contenido multimedia en Blob y otros...",
    "LOAD_BLOB_RELOAD": "Detectando contenido multimedia en Blob, recargando...",
    "NO_CHECK_RESOURCE": "Necesitas seleccionar un recurso para descargar.",
    "NO_VID_URL": "No se puede encontrar la URL del video.",
    "SETTING": "Configuraciones",
    "AUTO_RENAME": "Renombrar archivos automáticamente (clic derecho para configurar)",
    "RENAME_SHORTCODE": "Renombrar el archivo e incluir el código corto",
    "RENAME_PUBLISH_DATE": "Establecer la marca de tiempo del archivo renombrado a la fecha de publicación del recurso",
    "RENAME_LOCATE_DATE": "Modificar el formato de fecha de la marca de tiempo del archivo renombrado (clic derecho para configurar)",
    "DISABLE_VIDEO_LOOPING": "Desactivar el bucle automático de videos",
    "HTML5_VIDEO_CONTROL": "Mostrar controlador de video HTML5",
    "REDIRECT_CLICK_USER_STORY_PICTURE": "Redirigir al hacer clic en la foto del perfil del usuario",
    "FORCE_FETCH_ALL_RESOURCES": "Forzar la recuperación de todos los recursos en la publicación",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE": "Descargar directamente los recursos visibles en la publicación",
    "DIRECT_DOWNLOAD_ALL": "Descargar directamente todos los recursos en la publicación",
    "MODIFY_VIDEO_VOLUME": "Modificar el volumen del video (clic derecho para configurar)",
    "SCROLL_BUTTON": "Habilitar botones de desplazamiento para la página de Reels",
    "FORCE_RESOURCE_VIA_MEDIA": "Forzar la recuperación de recursos a través de API de medios",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LITMIT": "Usar métodos alternativos para descargar cuando la API de medios no esté accesible",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST": "Siempre usar API de medios para 'Abrir en una nueva pestaña' en publicaciones",
    "AUTO_RENAME_INTRO": "Renombrar automáticamente el archivo a un formato personalizado:\nLista de formatos personalizados:\n%USERNAME% - Nombre de usuario\n%SOURCE_TYPE% - Tipo de fuente\n%SHORTCODE% - Código corto de la publicación\n%YEAR% - Año de descarga/publicación\n%2-YEAR% - Año (dos últimas cifras) de descarga/publicación\n%MONTH% - Mes de descarga/publicación\n%DAY% - Día de descarga/publicación\n%HOUR% - Hora de descarga/publicación\n%MINUTE% - Minuto de descarga/publicación\n%SECOND% - Segundo de descarga/publicación\n%ORIGINAL_NAME% - Nombre original del archivo descargado\n%ORIGINAL_NAME_FIRST% - Nombre original del archivo descargado (primera parte del nombre)\n\nSi se establece en falso, el nombre del archivo permanecerá sin cambios.\nEjemplo: instagram_321565527_679025940443063_4318007696887450953_n.jpg",
    "RENAME_SHORTCODE_INTRO": "Renombrar automáticamente el archivo con el siguiente formato:\nNOMBRE_DE_USUARIO-TIPO-CODIGO_CORTO-TIMESTAMP.TIPO_ARCHIVO\nEjemplo: instagram-photo-CwkxyiVynpW-1670350000.jpg\n\nEsto SOLO funcionará si [Renombrar archivos automáticamente] está configurado en VERDADERO.",
    "RENAME_PUBLISH_DATE_INTRO": "Establece la marca de tiempo en el formato de renombrado de archivos a la fecha de publicación del recurso (zona horaria del navegador).\n\nEsta función solo funciona cuando [Renombrar archivos automáticamente] está configurado en VERDADERO.",
    "RENAME_LOCATE_DATE_INTRO": "Modificar el formato de fecha de la marca de tiempo renombrada a la hora local del navegador y formatearlo al formato de fecha regional preferido.\n\nEsta función solo funciona cuando [Renombrar archivos automáticamente] está configurado en VERDADERO.",
    "DISABLE_VIDEO_LOOPING_INTRO": "Desactiva el bucle automático de videos en Reels y publicaciones.",
    "HTML5_VIDEO_CONTROL_INTRO": "Muestra el controlador de video HTML5 en publicaciones y Reels.\n\nEsto ocultará el control deslizante de volumen personalizado y lo reemplazará con el controlador de HTML5. En páginas de Reels, el controlador de HTML5 se puede ocultar haciendo clic derecho en el video para revelar los detalles originales.",
    "REDIRECT_CLICK_USER_STORY_PICTURE_INTRO": "Redirigir a la página de perfil de un usuario al hacer clic derecho en su avatar en el área de historia de la página principal.\nSi utilizas el botón del medio del mouse para hacer clic, se abrirá en una nueva pestaña.",
    "FORCE_FETCH_ALL_RESOURCES_INTRO": "Forzar la recuperación de todos los recursos (fotos y videos) en una publicación a través de la API de Instagram para eliminar el límite de tres recursos por publicación.",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE_INTRO": "Descargar directamente los recursos actuales disponibles en la publicación.",
    "DIRECT_DOWNLOAD_ALL_INTRO": "Cuando haces clic en el botón de descargar, se forzará a recuperar y descargar todos los recursos en la publicación.",
    "MODIFY_VIDEO_VOLUME_INTRO": "Modificar el volumen de reproducción del video en Reels y publicaciones (clic derecho para abrir el control deslizante de configuración de volumen).",
    "SCROLL_BUTTON_INTRO": "Habilitar botones de desplazamiento para la esquina inferior derecha de la página de Reels.",
    "FORCE_RESOURCE_VIA_MEDIA_INTRO": "La API de medios intentará obtener la mejor calidad posible de foto o video, pero puede tardar más en cargar.",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LITMIT_INTRO": "Cuando la API de medios alcanza su límite de tasa o no se puede usar por otras razones, se utilizará la API de recuperación forzada para descargar recursos (la calidad del recurso puede ser ligeramente menor).",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST_INTRO": "El botón [Abrir en una nueva pestaña] en publicaciones siempre utilizará la API de medios para obtener recursos de alta resolución."
}