{
    "NOTICE_UPDATE_TITLE": "¡Wololo! Nueva versión disponible.",
    "NOTICE_UPDATE_CONTENT": "IG-Helper ha lanzado una nueva versión, haz clic aquí para actualizar.",
    "CHECK_UPDATE": "Comprobar actualizaciones del script",
    "CHECK_UPDATE_MENU": "Comprobar actualizaciones",
    "CHECK_UPDATE_INTRO": "Comprobar actualizaciones cuando se ejecuta el script (comprueba cada 300 segundos).\nLas notificaciones de actualización se enviarán como notificaciones de escritorio a través del navegador.",
    "RELOAD_SCRIPT": "Recargar script",
    "DONATE": "Donar",
    "FEEDBACK": "Comentarios",
    "NEW_TAB": "Abrir en una pestaña nueva",
    "SHOW_DOM_TREE": "Mostrar árbol DOM",
    "SELECT_AND_COPY": "Seleccionar todo y copiar desde el cuadro de entrada",
    "DOWNLOAD_DOM_TREE": "Descargar árbol DOM como un archivo de texto",
    "REPORT_GITHUB": "Reportar un problema en GitHub",
    "REPORT_DISCORD": "Reportar un problema en el servidor de soporte de Discord",
    "REPORT_FORK": "Reportar un problema en Greasy Fork",
    "DEBUG": "Ventana de depuración",
    "CLOSE": "Cerrar",
    "ALL_CHECK": "Seleccionar todo",
    "BATCH_DOWNLOAD_SELECTED": "Descargar recursos seleccionados",
    "BATCH_DOWNLOAD_DIRECT": "Descargar todos los recursos",
    "IMG": "Imagen",
    "VID": "Vídeo",
    "DW": "Descargar",
    "DW_ALL": "Descargar todos los recursos",
    "THUMBNAIL_INTRO": "Descargar miniatura del vídeo",
    "LOAD_BLOB_ONE": "Cargando el medio Blob...",
    "LOAD_BLOB_MULTIPLE": "Cargando el medio Blob y otros...",
    "LOAD_BLOB_RELOAD": "Detectando el medio Blob, recargando...",
    "NO_CHECK_RESOURCE": "Necesitas seleccionar un recurso para descargar.",
    "NO_VID_URL": "No se puede encontrar la URL del vídeo.",
    "SETTING": "Ajustes",
    "AUTO_RENAME": "Renombrar archivos automáticamente (clic derecho para configurar)",
    "RENAME_SHORTCODE": "Renombrar el archivo e incluir el código corto",
    "RENAME_PUBLISH_DATE": "Establecer la marca de tiempo de los archivos renombrados a la fecha de publicación del recurso",
    "RENAME_LOCATE_DATE": "Modificar el formato de fecha de la marca de tiempo de los archivos renombrados (clic derecho para configurar)",
    "DISABLE_VIDEO_LOOPING": "Desactivar la reproducción automática en bucle de los vídeos",
    "HTML5_VIDEO_CONTROL": "Mostrar el controlador de vídeo HTML5",
    "REDIRECT_CLICK_USER_STORY_PICTURE": "Redirigir al hacer clic en la foto de perfil en la historia del usuario",
    "FORCE_FETCH_ALL_RESOURCES": "Forzar la obtención de todos los recursos en la publicación",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE": "Descargar directamente los recursos visibles en la publicación",
    "DIRECT_DOWNLOAD_ALL": "Descargar directamente todos los recursos en la publicación",
    "MODIFY_VIDEO_VOLUME": "Modificar el volumen del vídeo (clic derecho para configurar)",
    "SCROLL_BUTTON": "Habilitar botones de desplazamiento para la página de Reels",
    "FORCE_RESOURCE_VIA_MEDIA": "Forzar la obtención de recursos a través de la API de Media",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LIMIT": "Usar métodos alternativos para descargar cuando la API de Media no es accesible",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST": "\"Abrir en una pestaña nueva\" en las publicaciones siempre usa la API de Media",
    "AUTO_RENAME_INTRO": "Renombrar archivos automáticamente a un formato personalizado\nLista de formatos personalizados: \n%USERNAME% - Nombre de usuario\n%SOURCE_TYPE% - Tipo de fuente\n%SHORTCODE% - Código corto de la publicación\n%YEAR% - Año de descarga/publicación\n%2-YEAR% - Año (últimos dos dígitos) de descarga/publicación\n%MONTH% - Mes de descarga/publicación\n%DAY% - Día de descarga/publicación\n%HOUR% - Hora de descarga/publicación\n%MINUTE% - Minuto de descarga/publicación\n%SECOND% - Segundo de descarga/publicación\n%ORIGINAL_NAME% - Nombre original del archivo descargado\n%ORIGINAL_NAME_FIRST% - Nombre original del archivo descargado (primera parte del nombre)\n\nSi se establece en falso, el nombre del archivo permanecerá sin cambios.\nEjemplo: instagram_321565527_679025940443063_4318007696887450953_n.jpg",
    "RENAME_SHORTCODE_INTRO": "Renombrar archivos automáticamente con el siguiente formato:\nNOMBRE_DE_USUARIO-TIPO-CODIGO_CORTO-MARCA_DE_TIEMPO.TIPO_ARCHIVO\nEjemplo: instagram-photo-CwkxyiVynpW-1670350000.jpg\n\nEsto SOLO funcionará si [Renombrar archivos automáticamente] está establecido en VERDADERO.",
    "RENAME_PUBLISH_DATE_INTRO": "Establece la marca de tiempo en el formato de renombramiento de archivos a la fecha de publicación del recurso (zona horaria del navegador).\n\nEsta función solo funciona cuando [Renombrar archivos automáticamente] está establecido en VERDADERO.",
    "RENAME_LOCATE_DATE_INTRO": "Modificar el formato de fecha de la marca de tiempo del archivo renombrado a la hora local del navegador y formatearlo a su formato de fecha regional preferido.\n\nEsta función solo funciona cuando [Renombrar archivos automáticamente] está establecido en VERDADERO.",
    "DISABLE_VIDEO_LOOPING_INTRO": "Desactivar la reproducción automática en bucle de los vídeos en Reels y publicaciones.",
    "HTML5_VIDEO_CONTROL_INTRO": "Mostrar el controlador de vídeo HTML5 en el recurso de vídeo.\n\nEsto ocultará el control deslizante de volumen de vídeo personalizado y lo reemplazará con el controlador HTML5. El controlador HTML5 se puede ocultar haciendo clic derecho en el vídeo para revelar los detalles originales.",
    "REDIRECT_CLICK_USER_STORY_PICTURE_INTRO": "Redirigir a la página de perfil de un usuario al hacer clic derecho en su avatar en el área de historias en la página de inicio.\nSi usa el botón central del ratón para hacer clic, se abrirá en una nueva pestaña.",
    "FORCE_FETCH_ALL_RESOURCES_INTRO": "Forzar la obtención de todos los recursos (fotos y vídeos) en una publicación a través de la API de Instagram para eliminar el límite de tres recursos por publicación.",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE_INTRO": "Descargar directamente los recursos actuales disponibles en la publicación.",
    "DIRECT_DOWNLOAD_ALL_INTRO": "Al hacer clic en el botón de descarga, todos los recursos de la publicación se obtendrán y descargarán directamente a la fuerza.",
    "MODIFY_VIDEO_VOLUME_INTRO": "Modificar el volumen de reproducción de vídeo en Reels y publicaciones (haga clic derecho para abrir el control deslizante de configuración de volumen).",
    "SCROLL_BUTTON_INTRO": "Habilitar botones de desplazamiento para la esquina inferior derecha de la página de Reels.",
    "FORCE_RESOURCE_VIA_MEDIA_INTRO": "La API de Media intentará obtener la foto o el vídeo de mayor calidad posible, pero puede tardar más en cargarse.",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LIMIT_INTRO": "Cuando la API de Media alcanza su límite de tasa o no se puede usar por otras razones, se utilizará la API de obtención forzada para descargar recursos (la calidad del recurso puede ser ligeramente inferior).",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST_INTRO": "El botón [Abrir en una pestaña nueva] en las publicaciones siempre usará la API de Media para obtener recursos de alta resolución.",
    "SKIP_VIEW_STORY_CONFIRM": "Omitir la página de confirmación al ver una historia o un contenido destacado",
    "SKIP_VIEW_STORY_CONFIRM_INTRO": "Omitir automáticamente cuando se muestra la página de confirmación en la historia o el contenido destacado."
}