{
    "NOTICE_UPDATE_TITLE": "Wololo ! Nouvelle version disponible.",
    "NOTICE_UPDATE_CONTENT": "IG-Helper a publié une nouvelle version, cliquez ici pour mettre à jour.",
    "CHECK_UPDATE": "Vérifier les mises à jour du script",
    "CHECK_UPDATE_MENU": "Vérifier les mises à jour",
    "CHECK_UPDATE_INTRO": "Vérifier les mises à jour lorsque le script est déclenché (vérification toutes les 300 secondes).\nLes notifications de mise à jour seront envoyées en tant que notifications de bureau via le navigateur.",
    "RELOAD_SCRIPT": "Recharger le script",
    "DONATE": "Faire un don",
    "FEEDBACK": "Commentaires",
    "IMAGE_VIEWER": "Ouvrir l'image dans le visionneur",
    "NEW_TAB": "Ouvrir dans un nouvel onglet",
    "SHOW_DOM_TREE": "Afficher l'arborescence DOM",
    "SELECT_AND_COPY": "Tout sélectionner et copier depuis la zone de saisie",
    "DOWNLOAD_DOM_TREE": "Télécharger l'arborescence DOM en tant que fichier texte",
    "REPORT_GITHUB": "Signaler un problème sur GitHub",
    "REPORT_DISCORD": "Signaler un problème sur le serveur d'assistance Discord",
    "REPORT_FORK": "Signaler un problème sur Greasy Fork",
    "DEBUG": "Fenêtre de débogage",
    "CLOSE": "Fermer",
    "ALL_CHECK": "Tout sélectionner",
    "BATCH_DOWNLOAD_SELECTED": "Télécharger les ressources sélectionnées",
    "BATCH_DOWNLOAD_DIRECT": "Télécharger toutes les ressources",
    "IMG": "Image",
    "VID": "Vidéo",
    "DW": "Télécharger",
    "DW_ALL": "Télécharger toutes les ressources",
    "THUMBNAIL_INTRO": "Télécharger la miniature de la vidéo",
    "LOAD_BLOB_ONE": "Chargement du média Blob...",
    "LOAD_BLOB_MULTIPLE": "Chargement du média Blob et autres...",
    "LOAD_BLOB_RELOAD": "Détection du média Blob, rechargement...",
    "NO_CHECK_RESOURCE": "Vous devez sélectionner une ressource à télécharger.",
    "NO_VID_URL": "Impossible de trouver l'URL de la vidéo.",
    "SETTING": "Paramètres",
    "AUTO_RENAME": "Renommer automatiquement les fichiers (clic droit pour configurer)",
    "RENAME_SHORTCODE": "Renommer le fichier et inclure le code court",
    "RENAME_PUBLISH_DATE": "Définir l'horodatage des fichiers renommés à la date de publication de la ressource",
    "RENAME_LOCATE_DATE": "Modifier le format de date de l'horodatage des fichiers renommés (clic droit pour configurer)",
    "DISABLE_VIDEO_LOOPING": "Désactiver la lecture automatique en boucle des vidéos",
    "HTML5_VIDEO_CONTROL": "Afficher le contrôleur vidéo HTML5",
    "REDIRECT_CLICK_USER_STORY_PICTURE": "Rediriger lors d'un clic sur la photo de profil dans la story de l'utilisateur",
    "FORCE_FETCH_ALL_RESOURCES": "Forcer la récupération de toutes les ressources du post",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE": "Télécharger directement les ressources visibles dans le post",
    "DIRECT_DOWNLOAD_ALL": "Télécharger directement toutes les ressources du post",
    "MODIFY_VIDEO_VOLUME": "Modifier le volume de la vidéo (clic droit pour configurer)",
    "DIRECT_DOWNLOAD_STORY": "Télécharger directement toutes les ressources de l’histoire/mise en avant",
    "MODIFY_RESOURCE_EXIF": "Modifier les attributs EXIF de la ressource",
    "SCROLL_BUTTON": "Activer les boutons de défilement pour la page des Reels",
    "FORCE_RESOURCE_VIA_MEDIA": "Forcer la récupération des ressources via l'API Media",
    "FALLBACK_TO_BLOB_FETCH_IF_MEDIA_API_THROTTLED": "Utiliser des méthodes alternatives de téléchargement lorsque l'API Media n'est pas accessible",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST": "« Ouvrir dans un nouvel onglet » dans les posts utilise toujours l'API Media",
    "SKIP_VIEW_STORY_CONFIRM": "Ignorer la page de confirmation lors de la visualisation d'une story ou d'un contenu à la une",
    "AUTO_RENAME_INTRO": "Renommer automatiquement les fichiers dans un format personnalisé\nListe des formats personnalisés : \n%USERNAME% - Nom d'utilisateur\n%SOURCE_TYPE% - Type de source\n%SHORTCODE% - Code court du post\n%YEAR% - Année de téléchargement/publication\n%2-YEAR% - Année (deux derniers chiffres) de téléchargement/publication\n%MONTH% - Mois de téléchargement/publication\n%DAY% - Jour de téléchargement/publication\n%HOUR% - Heure de téléchargement/publication\n%MINUTE% - Minute de téléchargement/publication\n%SECOND% - Seconde de téléchargement/publication\n%ORIGINAL_NAME% - Nom original du fichier téléchargé\n%ORIGINAL_NAME_FIRST% - Nom original du fichier téléchargé (première partie du nom)\n\nSi défini sur faux, le nom du fichier restera inchangé.\nExemple : instagram_321565527_679025940443063_4318007696887450953_n.jpg",
    "RENAME_SHORTCODE_INTRO": "Renommer automatiquement les fichiers avec le format suivant :\nNOM_UTILISATEUR-TYPE-CODE_COURT-HORODATAGE.TYPE_FICHIER\nExemple : instagram-photo-CwkxyiVynpW-1670350000.jpg\n\nFonctionne UNIQUEMENT si [Renommer automatiquement les fichiers] est défini sur VRAI.",
    "RENAME_PUBLISH_DATE_INTRO": "Définit l'horodatage dans le format de renommage de fichier à la date de publication de la ressource (fuseau horaire du navigateur).\n\nFonctionne UNIQUEMENT si [Renommer automatiquement les fichiers] est défini sur VRAI.",
    "RENAME_LOCATE_DATE_INTRO": "Modifier le format de date de l'horodatage de renommage de fichier à l'heure locale du navigateur et le formater selon le format de date régional souhaité.\n\nFonctionne UNIQUEMENT si [Renommer automatiquement les fichiers] est défini sur VRAI.",
    "DISABLE_VIDEO_LOOPING_INTRO": "Désactiver la lecture automatique en boucle des vidéos dans les Reels et les posts.",
    "HTML5_VIDEO_CONTROL_INTRO": "Afficher le contrôleur vidéo HTML5 dans la ressource vidéo.\n\nCela masquera le curseur de volume vidéo personnalisé et le remplacera par le contrôleur HTML5. Le contrôleur HTML5 peut être masqué en faisant un clic droit sur la vidéo pour révéler les détails d'origine.",
    "REDIRECT_CLICK_USER_STORY_PICTURE_INTRO": "Rediriger vers la page de profil d'un utilisateur en faisant un clic droit sur son avatar dans la zone des stories sur la page d'accueil.\nSi vous utilisez le bouton central de la souris pour cliquer, cela s'ouvrira dans un nouvel onglet.",
    "FORCE_FETCH_ALL_RESOURCES_INTRO": "Forcer la récupération de toutes les ressources (photos et vidéos) d'un post via l'API Instagram pour supprimer la limite de trois ressources par post.",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE_INTRO": "Télécharger directement les ressources actuelles disponibles dans le post.",
    "DIRECT_DOWNLOAD_ALL_INTRO": "Lorsque vous cliquez sur le bouton de téléchargement, toutes les ressources du post seront directement forcées d'être récupérées et téléchargées.",
    "MODIFY_VIDEO_VOLUME_INTRO": "Modifier le volume de lecture vidéo dans les Reels et les posts (clic droit pour ouvrir le curseur de réglage du volume).",
    "SCROLL_BUTTON_INTRO": "Activer les boutons de défilement pour le coin inférieur droit de la page des Reels.",
    "FORCE_RESOURCE_VIA_MEDIA_INTRO": "L'API Media essaiera d'obtenir la meilleure qualité possible pour les photos ou les vidéos, mais le chargement prendra plus de temps.",
    "FALLBACK_TO_BLOB_FETCH_IF_MEDIA_API_THROTTLED_INTRO": "Lorsque l'API Media atteint sa limite de taux ou ne peut pas être utilisée pour d'autres raisons, l'API de récupération forcée sera utilisée pour télécharger les ressources (la qualité des ressources peut être légèrement inférieure).",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST_INTRO": "Le bouton [Ouvrir dans un nouvel onglet] dans les posts utilisera toujours l'API Media pour obtenir des ressources en haute résolution.",
    "SKIP_VIEW_STORY_CONFIRM_INTRO": "Ignorer automatiquement lorsque la page de confirmation est affichée dans la story ou le contenu à la une.",
    "MODIFY_RESOURCE_EXIF_INTRO": "Modifier les attributs EXIF de la ressource image afin de placer le lien du post à l'intérieur.",
    "DIRECT_DOWNLOAD_STORY_INTRO": "Lorsque vous cliquez sur « Télécharger toutes les ressources », toutes les stories/à la une sont téléchargées directement, sans afficher la boîte de dialogue de sélection des images."
}