{
    "NOTICE_UPDATE_TITLE": "Wololo ! Nouvelle version publiée.",
    "NOTICE_UPDATE_CONTENT": "IG-Helper a publié une nouvelle version, cliquez ici pour mettre à jour.",
    "CHECK_UPDATE": "Vérification des mises à jour du script",
    "CHECK_UPDATE_INTRO": "Vérifiez les mises à jour lorsque le script est déclenché (vérifiez toutes les 300 secondes).\nLes notifications de mise à jour seront envoyées sous forme de notifications de bureau via le navigateur.",
    "RELOAD_SCRIPT": "Recharger le script",
    "DONATE": "Faire un don",
    "FEEDBACK": "Retours",
    "NEW_TAB": "Ouvrir dans un nouvel onglet",
    "SHOW_DOM_TREE": "Afficher l'arbre DOM",
    "SELECT_AND_COPY": "Sélectionner tout et copier depuis la boîte de saisie",
    "DOWNLOAD_DOM_TREE": "Télécharger l'arbre DOM en tant que fichier texte",
    "REPORT_GITHUB": "Signaler un problème sur GitHub",
    "REPORT_DISCORD": "Signaler un problème sur le serveur de support Discord",
    "REPORT_FORK": "Signaler un problème sur Greasy Fork",
    "DEBUG": "Fenêtre de débogage",
    "CLOSE": "Fermer",
    "ALL_CHECK": "Tout sélectionner",
    "BATCH_DOWNLOAD_SELECTED": "Télécharger les ressources sélectionnées",
    "BATCH_DOWNLOAD_DIRECT": "Télécharger toutes les ressources",
    "IMG": "Image",
    "VID": "Vidéo",
    "DW": "Télécharger",
    "THUMBNAIL_INTRO": "Télécharger la miniature de la vidéo",
    "LOAD_BLOB_ONE": "Chargement du contenu multimédia en Blob...",
    "LOAD_BLOB_MULTIPLE": "Chargement du contenu multimédia en Blob et d'autres...",
    "LOAD_BLOB_RELOAD": "Détection du contenu multimédia en Blob, rechargement...",
    "NO_CHECK_RESOURCE": "Vous devez sélectionner une ressource à télécharger.",
    "NO_VID_URL": "Impossible de trouver l'URL de la vidéo.",
    "SETTING": "Paramètres",
    "AUTO_RENAME": "Renommer automatiquement les fichiers (clic droit pour configurer)",
    "RENAME_SHORTCODE": "Renommer le fichier et inclure le code court",
    "RENAME_PUBLISH_DATE": "Définir le timestamp du fichier renommé à la date de publication de la ressource",
    "RENAME_LOCATE_DATE": "Modifier le format de date du timestamp du fichier renommé (clic droit pour configurer)",
    "DISABLE_VIDEO_LOOPING": "Désactiver la répétition automatique des vidéos",
    "HTML5_VIDEO_CONTROL": "Afficher le contrôleur vidéo HTML5",
    "REDIRECT_CLICK_USER_STORY_PICTURE": "Rediriger en cliquant sur la photo de profil de l'utilisateur",
    "FORCE_FETCH_ALL_RESOURCES": "Forcer la récupération de toutes les ressources dans le post",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE": "Télécharger directement les ressources visibles dans le post",
    "DIRECT_DOWNLOAD_ALL": "Télécharger directement toutes les ressources dans le post",
    "MODIFY_VIDEO_VOLUME": "Modifier le volume de la vidéo (clic droit pour configurer)",
    "SCROLL_BUTTON": "Activer les boutons de défilement pour la page Reels",
    "FORCE_RESOURCE_VIA_MEDIA": "Forcer la récupération des ressources via Media API",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LITMIT": "Utiliser des méthodes alternatives pour télécharger lorsque l'API médias n'est pas accessible",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST": "Toujours utiliser l'API médias pour 'Ouvrir dans un nouvel onglet' dans les posts",
    "AUTO_RENAME_INTRO": "Renommer automatiquement le fichier dans un format personnalisé :\nListe des formats personnalisés :\n%USERNAME% - Nom d'utilisateur\n%SOURCE_TYPE% - Type de source\n%SHORTCODE% - Code court du post\n%YEAR% - Année de téléchargement/publication\n%2-YEAR% - Année (deux derniers chiffres) de téléchargement/publication\n%MONTH% - Mois de téléchargement/publication\n%DAY% - Jour de téléchargement/publication\n%HOUR% - Heure de téléchargement/publication\n%MINUTE% - Minute de téléchargement/publication\n%SECOND% - Seconde de téléchargement/publication\n%ORIGINAL_NAME% - Nom original du fichier téléchargé\n%ORIGINAL_NAME_FIRST% - Nom original du fichier téléchargé (première partie du nom)\n\nSi défini sur faux, le nom du fichier restera inchangé.\nExemple : instagram_321565527_679025940443063_4318007696887450953_n.jpg",
    "RENAME_SHORTCODE_INTRO": "Renommer automatiquement le fichier au format suivant :\nNOM_UTILISATEUR-TYPE-CODE_COURT-TIMESTAMP.TYPE_FICHIER\nExemple : instagram-photo-CwkxyiVynpW-1670350000.jpg\n\nCela ne fonctionnera QUE si [Renommer automatiquement les fichiers] est défini sur VRAI.",
    "RENAME_PUBLISH_DATE_INTRO": "Définit le timestamp dans le format de renommage de fichier à la date de publication des ressources (fuseau horaire du navigateur).\n\nCette fonctionnalité ne fonctionne que lorsque [Renommer automatiquement les fichiers] est défini sur VRAI.",
    "RENAME_LOCATE_DATE_INTRO": "Modifier le format de date du timestamp pour les fichiers renommés à l'heure locale du navigateur et le formater selon le format de date régional préféré.\n\nCette fonctionnalité ne fonctionne que lorsque [Renommer automatiquement les fichiers] est défini sur VRAI.",
    "DISABLE_VIDEO_LOOPING_INTRO": "Désactiver la répétition automatique des vidéos dans les Reels et les posts.",
    "HTML5_VIDEO_CONTROL_INTRO": "Afficher le contrôleur vidéo HTML5 dans les posts et les Reels.\n\nCela masquera le contrôleur de volume personnalisé et le remplacera par le contrôleur HTML5. Sur les pages Reels, le contrôleur HTML5 peut être masqué en cliquant droit sur la vidéo pour révéler les détails originaux.",
    "REDIRECT_CLICK_USER_STORY_PICTURE_INTRO": "Rediriger vers la page de profil d'un utilisateur en cliquant droit sur son avatar dans la zone de l'histoire sur la page d'accueil.\nSi vous utilisez le bouton du milieu de la souris pour cliquer, cela s'ouvrira dans un nouvel onglet.",
    "FORCE_FETCH_ALL_RESOURCES_INTRO": "Forcer la récupération de toutes les ressources (photos et vidéos) dans un post via l'API Instagram pour supprimer la limite de trois ressources par post.",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE_INTRO": "Télécharger directement les ressources actuellement disponibles dans le post.",
    "DIRECT_DOWNLOAD_ALL_INTRO": "Lorsque vous cliquez sur le bouton de téléchargement, toutes les ressources du post seront récupérées et téléchargées de manière forcée.",
    "MODIFY_VIDEO_VOLUME_INTRO": "Modifier le volume de lecture de la vidéo dans les Reels et les posts (clic droit pour ouvrir le curseur de réglage du volume).",
    "SCROLL_BUTTON_INTRO": "Activer les boutons de défilement pour le coin inférieur droit de la page Reels.",
    "FORCE_RESOURCE_VIA_MEDIA_INTRO": "L'API médias essaiera d'obtenir la meilleure qualité possible d'image ou de vidéo, mais cela peut prendre plus de temps à charger.",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LITMIT_INTRO": "Lorsque l'API médias atteint sa limite de vitesse ou ne peut pas être utilisée pour d'autres raisons, l'API de récupération forcée sera utilisée pour télécharger les ressources (la qualité des ressources peut être légèrement inférieure).",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST_INTRO": "Le bouton [Ouvrir dans un nouvel onglet] dans les posts utilisera toujours l'API médias pour obtenir des ressources en haute résolution."
}