{
    "NOTICE_UPDATE_TITLE": "Wololo! Nuova versione rilasciata.",
    "NOTICE_UPDATE_CONTENT": "IG-Helper ha rilasciato una nuova versione, clicca qui per aggiornare.",
    "CHECK_UPDATE": "Controllo aggiornamenti dello script",
    "CHECK_UPDATE_INTRO": "Controlla gli aggiornamenti quando lo script viene attivato (controlla ogni 300 secondi).\nLe notifiche sugli aggiornamenti verranno inviate come notifiche desktop tramite il browser.",
    "RELOAD_SCRIPT": "Ricarica script",
    "DONATE": "Dona",
    "FEEDBACK": "Feedback",
    "NEW_TAB": "Apri in una nuova scheda",
    "SHOW_DOM_TREE": "Mostra albero DOM",
    "SELECT_AND_COPY": "Seleziona tutto e copia dalla casella di input",
    "DOWNLOAD_DOM_TREE": "Scarica albero DOM come file di testo",
    "REPORT_GITHUB": "Segnala un problema su GitHub",
    "REPORT_DISCORD": "Segnala un problema sul server di supporto Discord",
    "REPORT_FORK": "Segnala un problema su Greasy Fork",
    "DEBUG": "Finestra di debug",
    "CLOSE": "Chiudi",
    "ALL_CHECK": "Seleziona tutto",
    "BATCH_DOWNLOAD_SELECTED": "Scarica risorse selezionate",
    "BATCH_DOWNLOAD_DIRECT": "Scarica tutte le risorse",
    "IMG": "Immagine",
    "VID": "Video",
    "DW": "Scarica",
    "THUMBNAIL_INTRO": "Scarica miniatura video",
    "LOAD_BLOB_ONE": "Caricamento contenuti multimediali in formato Blob...",
    "LOAD_BLOB_MULTIPLE": "Caricamento contenuti multimediali in formato Blob e altri...",
    "LOAD_BLOB_RELOAD": "Rilevando contenuti multimediali in formato Blob, ricaricando...",
    "NO_CHECK_RESOURCE": "Devi selezionare una risorsa da scaricare.",
    "NO_VID_URL": "Impossibile trovare l'URL del video.",
    "SETTING": "Impostazioni",
    "AUTO_RENAME": "Rinomina automaticamente i file (clic destro per impostare)",
    "RENAME_SHORTCODE": "Rinomina il file e includi shortcode",
    "RENAME_PUBLISH_DATE": "Imposta il timestamp del file rinominato sulla data di pubblicazione della risorsa",
    "RENAME_LOCATE_DATE": "Modifica il formato della data del timestamp del file rinominato (clic destro per impostare)",
    "DISABLE_VIDEO_LOOPING": "Disabilita il looping automatico dei video",
    "HTML5_VIDEO_CONTROL": "Mostra controller video HTML5",
    "REDIRECT_CLICK_USER_STORY_PICTURE": "Reindirizza quando si fa clic sulla foto del profilo dell'utente",
    "FORCE_FETCH_ALL_RESOURCES": "Forza il recupero di tutte le risorse nel post",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE": "Scarica direttamente le risorse visibili nel post",
    "DIRECT_DOWNLOAD_ALL": "Scarica direttamente tutte le risorse nel post",
    "MODIFY_VIDEO_VOLUME": "Modifica il volume del video (clic destro per impostare)",
    "SCROLL_BUTTON": "Abilita pulsanti di scorrimento per la pagina Reels",
    "FORCE_RESOURCE_VIA_MEDIA": "Forza il recupero delle risorse tramite Media API",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LITMIT": "Usa metodi alternativi per scaricare quando Media API non è accessibile",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST": "Usa sempre Media API per 'Apri in una nuova scheda' nei post",
    "AUTO_RENAME_INTRO": "Rinomina automaticamente il file in un formato personalizzato:\nElenco formati personalizzati:\n%USERNAME% - Nome utente\n%SOURCE_TYPE% - Tipo di sorgente\n%SHORTCODE% - Shortcode del post\n%YEAR% - Anno di download/pubblicazione\n%2-YEAR% - Anno (ultime due cifre) di download/pubblicazione\n%MONTH% - Mese di download/pubblicazione\n%DAY% - Giorno di download/pubblicazione\n%HOUR% - Ora di download/pubblicazione\n%MINUTE% - Minuto di download/pubblicazione\n%SECOND% - Secondo di download/pubblicazione\n%ORIGINAL_NAME% - Nome originale del file scaricato\n%ORIGINAL_NAME_FIRST% - Nome originale del file scaricato (prima parte del nome)\n\nSe impostato su falso, il nome del file rimarrà invariato.\nEsempio: instagram_321565527_679025940443063_4318007696887450953_n.jpg",
    "RENAME_SHORTCODE_INTRO": "Rinomina automaticamente il file nel seguente formato:\nNOME_UTENTE-TIPO-CODICE_CORTO-TIMESTAMP.TIPO_FILE\nEsempio: instagram-photo-CwkxyiVynpW-1670350000.jpg\n\nQuesto funzionerà SOLO se [Rinomina automaticamente i file] è impostato su VERO.",
    "RENAME_PUBLISH_DATE_INTRO": "Imposta il timestamp nel formato di rinomino del file sulla data di pubblicazione delle risorse (fuso orario del browser).\n\nQuesta funzione funziona soltanto quando [Rinomina automaticamente i file] è impostato su VERO.",
    "RENAME_LOCATE_DATE_INTRO": "Modifica il formato della data del timestamp per i file rinominati al fuso orario locale del browser e formattalo secondo il formato di data regionale preferito.\n\nQuesta funzione funziona soltanto quando [Rinomina automaticamente i file] è impostato su VERO.",
    "DISABLE_VIDEO_LOOPING_INTRO": "Disabilita il looping automatico dei video nei Reels e nei post.",
    "HTML5_VIDEO_CONTROL_INTRO": "Mostra il controller video HTML5 nei post e nei Reels.\n\nQuesto nasconderà il cursore del volume personalizzato e lo sostituirà con il controller HTML5. Nelle pagine dei Reels, il controller HTML5 può essere nascosto facendo clic destro sul video per rivelare i dettagli originali.",
    "REDIRECT_CLICK_USER_STORY_PICTURE_INTRO": "Reindirizza alla pagina del profilo di un utente quando si fa clic destro sul suo avatar nell'area della storia sulla homepage.\nSe utilizzi il pulsante centrale del mouse per fare clic, si aprirà in una nuova scheda.",
    "FORCE_FETCH_ALL_RESOURCES_INTRO": "Forza il recupero di tutte le risorse (foto e video) in un post tramite l'API di Instagram per rimuovere il limite di tre risorse per post.",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE_INTRO": "Scarica direttamente le risorse attualmente disponibili nel post.",
    "DIRECT_DOWNLOAD_ALL_INTRO": "Quando fai clic sul pulsante di download, tutte le risorse nel post verranno recuperate e scaricate forzatamente.",
    "MODIFY_VIDEO_VOLUME_INTRO": "Modifica il volume di riproduzione del video nei Reels e nei post (clic destro per aprire il cursore di impostazione del volume).",
    "SCROLL_BUTTON_INTRO": "Abilita i pulsanti di scorrimento per l'angolo inferiore destro della pagina dei Reels.",
    "FORCE_RESOURCE_VIA_MEDIA_INTRO": "L'API di Media cercherà di ottenere la migliore qualità possibile per foto o video, ma potrebbe richiedere più tempo per il caricamento.",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LITMIT_INTRO": "Quando l'API di Media raggiunge il suo limite di velocità o non può essere utilizzata per altri motivi, verrà utilizzata l'API di recupero forzato per scaricare le risorse (la qualità della risorsa potrebbe essere leggermente inferiore).",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST_INTRO": "Il pulsante [Apri in una nuova scheda] nei post utilizzerà sempre l'API di Media per ottenere risorse ad alta risoluzione.",
    "SKIP_VIEW_STORY_CONFIRM": "Salta la pagina di conferma per visualizzare una storia/risalto",
    "SKIP_VIEW_STORY_CONFIRM_INTRO": "Salta automaticamente quando la pagina di conferma viene mostrata nella storia o nel risalto."
}