{
    "NOTICE_UPDATE_TITLE": "Wololo! Nova versão lançada.",
    "NOTICE_UPDATE_CONTENT": "IG-Helper lançou uma nova versão, clique aqui para atualizar.",
    "CHECK_UPDATE": "Verificar atualizações do script",
    "CHECK_UPDATE_MENU": "Verificar atualizações",
    "CHECK_UPDATE_INTRO": "Verificar atualizações quando o script é acionado (verificar a cada 300 segundos).\nAs notificações de atualização serão enviadas como notificações de desktop através do navegador.",
    "RELOAD_SCRIPT": "Recarregar script",
    "DONATE": "Doar",
    "FEEDBACK": "Feedback",
    "IMAGE_VIEWER": "Abrir imagem no visualizador",
    "NEW_TAB": "Abrir em nova aba",
    "SHOW_DOM_TREE": "Mostrar árvore DOM",
    "SELECT_AND_COPY": "Selecionar tudo e copiar da caixa de entrada",
    "DOWNLOAD_DOM_TREE": "Baixar árvore DOM como um arquivo de texto",
    "REPORT_GITHUB": "Reportar um problema no GitHub",
    "REPORT_DISCORD": "Reportar um problema no servidor de suporte do Discord",
    "REPORT_FORK": "Reportar um problema no Greasy Fork",
    "DEBUG": "Janela de depuração",
    "CLOSE": "Fechar",
    "ALL_CHECK": "Selecionar tudo",
    "BATCH_DOWNLOAD_SELECTED": "Baixar recursos selecionados",
    "BATCH_DOWNLOAD_DIRECT": "Baixar todos os recursos",
    "IMG": "Imagem",
    "VID": "Vídeo",
    "DW": "Baixar",
    "DW_ALL": "Baixar todos os recursos",
    "THUMBNAIL_INTRO": "Baixar miniatura do vídeo",
    "LOAD_BLOB_ONE": "Carregando a mídia Blob...",
    "LOAD_BLOB_MULTIPLE": "Carregando a mídia Blob e outros...",
    "LOAD_BLOB_RELOAD": "Detectando a mídia Blob, recarregando...",
    "NO_CHECK_RESOURCE": "Você precisa selecionar um recurso para baixar.",
    "NO_VID_URL": "Não é possível encontrar o URL do vídeo.",
    "SETTING": "Configurações",
    "AUTO_RENAME": "Renomear arquivos automaticamente (clique com o botão direito para definir)",
    "RENAME_SHORTCODE": "Renomear o arquivo e incluir o código curto",
    "RENAME_PUBLISH_DATE": "Definir o carimbo de data/hora dos arquivos renomeados para a data de publicação do recurso",
    "RENAME_LOCATE_DATE": "Modificar o formato da data do carimbo de data/hora dos arquivos renomeados (clique com o botão direito para definir)",
    "DISABLE_VIDEO_LOOPING": "Desativar a reprodução automática em loop de vídeos",
    "HTML5_VIDEO_CONTROL": "Exibir o controlador de vídeo HTML5",
    "REDIRECT_CLICK_USER_STORY_PICTURE": "Redirecionar ao clicar na foto do perfil na story do usuário",
    "FORCE_FETCH_ALL_RESOURCES": "Forçar a busca de todos os recursos na publicação",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE": "Baixar diretamente os recursos visíveis na publicação",
    "DIRECT_DOWNLOAD_ALL": "Baixar diretamente todos os recursos na publicação",
    "MODIFY_VIDEO_VOLUME": "Modificar o volume do vídeo (clique com o botão direito para definir)",
    "SCROLL_BUTTON": "Habilitar botões de rolagem para a página de Reels",
    "FORCE_RESOURCE_VIA_MEDIA": "Forçar a busca de recursos via API de Mídia",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LIMIT": "Usar métodos alternativos para baixar quando a API de Mídia não estiver acessível",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST": "\"Abrir em nova aba\" nas publicações sempre usa a API de Mídia",
    "AUTO_RENAME_INTRO": "Renomear automaticamente os arquivos para um formato personalizado\nLista de formatos personalizados: \n%USERNAME% - Nome de usuário\n%SOURCE_TYPE% - Tipo de fonte\n%SHORTCODE% - Código curto da publicação\n%YEAR% - Ano de download/publicação\n%2-YEAR% - Ano (dois últimos dígitos) de download/publicação\n%MONTH% - Mês de download/publicação\n%DAY% - Dia de download/publicação\n%HOUR% - Hora de download/publicação\n%MINUTE% - Minuto de download/publicação\n%SECOND% - Segundo de download/publicação\n%ORIGINAL_NAME% - Nome original do arquivo baixado\n%ORIGINAL_NAME_FIRST% - Nome original do arquivo baixado (primeira parte do nome)\n\nSe definido como falso, o nome do arquivo permanecerá inalterado.\nExemplo: instagram_321565527_679025940443063_4318007696887450953_n.jpg",
    "RENAME_SHORTCODE_INTRO": "Renomear automaticamente os arquivos com o seguinte formato:\nNOME_DE_USUÁRIO-TIPO-CÓDIGO_CURTO-CARIMBO_DE_DATA/HORA.TIPO_DE_ARQUIVO\nExemplo: instagram-photo-CwkxyiVynpW-1670350000.jpg\n\nIsso funcionará APENAS se [Renomear arquivos automaticamente] estiver definido como VERDADEIRO.",
    "RENAME_PUBLISH_DATE_INTRO": "Define o carimbo de data/hora no formato de renomeação de arquivo para a data de publicação do recurso (fuso horário do navegador).\n\nEsse recurso só funciona quando [Renomear arquivos automaticamente] está definido como VERDADEIRO.",
    "RENAME_LOCATE_DATE_INTRO": "Modificar o formato da data do carimbo de data/hora do arquivo renomeado para a hora local do navegador e formatá-lo para o formato de data regional de sua preferência.\n\nEsse recurso só funciona quando [Renomear arquivos automaticamente] está definido como VERDADEIRO.",
    "DISABLE_VIDEO_LOOPING_INTRO": "Desativar a reprodução automática em loop de vídeos em Reels e publicações.",
    "HTML5_VIDEO_CONTROL_INTRO": "Exibir o controlador de vídeo HTML5 no recurso de vídeo.\n\nIsso ocultará o controle deslizante de volume de vídeo personalizado e o substituirá pelo controlador HTML5. O controlador HTML5 pode ser ocultado clicando com o botão direito do mouse no vídeo para revelar os detalhes originais.",
    "REDIRECT_CLICK_USER_STORY_PICTURE_INTRO": "Redirecionar para a página de perfil de um usuário ao clicar com o botão direito do mouse em seu avatar na área de stories na página inicial.\nSe você usar o botão do meio do mouse para clicar, ele será aberto em uma nova aba.",
    "FORCE_FETCH_ALL_RESOURCES_INTRO": "Forçar a busca de todos os recursos (fotos e vídeos) em uma publicação por meio da API do Instagram para remover o limite de três recursos por publicação.",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE_INTRO": "Baixar diretamente os recursos atuais disponíveis na publicação.",
    "DIRECT_DOWNLOAD_ALL_INTRO": "Ao clicar no botão de download, todos os recursos da publicação serão forçados a serem buscados e baixados diretamente.",
    "MODIFY_VIDEO_VOLUME_INTRO": "Modificar o volume de reprodução de vídeo em Reels e publicações (clique com o botão direito do mouse para abrir o controle deslizante de configuração de volume).",
    "SCROLL_BUTTON_INTRO": "Habilitar botões de rolagem para o canto inferior direito da página de Reels.",
    "FORCE_RESOURCE_VIA_MEDIA_INTRO": "A API de Mídia tentará obter a foto ou o vídeo da mais alta qualidade possível, mas pode demorar mais para carregar.",
    "USE_BLOB_FETCH_WHEN_MEDIA_RATE_LIMIT_INTRO": "Quando a API de Mídia atingir seu limite de taxa ou não puder ser usada por outros motivos, a API de Busca Forçada será usada para baixar recursos (a qualidade do recurso pode ser um pouco menor).",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST_INTRO": "O botão [Abrir em nova aba] nas publicações sempre usará a API de Mídia para obter recursos de alta resolução.",
    "SKIP_VIEW_STORY_CONFIRM": "Pular a página de confirmação ao visualizar uma story ou um destaque",
    "SKIP_VIEW_STORY_CONFIRM_INTRO": "Pular automaticamente quando a página de confirmação for exibida na story ou no destaque."
}