{
    "NOTICE_UPDATE_TITLE": "Wololo! O nouă versiune a fost lansată.",
    "NOTICE_UPDATE_CONTENT": "IG-Helper a lansat o nouă versiune, dă click aici pentru a actualiza.",
    "CHECK_UPDATE": "Caută actualizări pentru script",
    "CHECK_UPDATE_MENU": "Caută actualizări",
    "CHECK_UPDATE_INTRO": "Caută actualizări atunci când scriptul este activat (verifică la fiecare 300 de secunde).\nNotificările pentru actualizare vor fi trimise ca notificări desktop prin intermediul browserului.",
    "RELOAD_SCRIPT": "Reîncarcă scriptul",
    "DONATE": "Donează",
    "FEEDBACK": "Feedback",
    "IMAGE_VIEWER": "Deschide imaginea în vizualizator",
    "NEW_TAB": "Deschide într-o filă nouă",
    "SHOW_DOM_TREE": "Afișează arborele DOM",
    "SELECT_AND_COPY": "Selectează tot și copiază din caseta de introducere",
    "DOWNLOAD_DOM_TREE": "Descarcă arborele DOM în format text",
    "REPORT_GITHUB": "Raportează o problemă pe GitHub",
    "REPORT_DISCORD": "Raportează o problemă pe serverul de suport Discord",
    "REPORT_FORK": "Raportează o problemă pe Greasy Fork",
    "DEBUG": "Fereastră de depanare",
    "CLOSE": "Închide",
    "ALL_CHECK": "Selectează toate",
    "BATCH_DOWNLOAD_SELECTED": "Descarcă resursele selectate",
    "BATCH_DOWNLOAD_DIRECT": "Descarcă toate resursele",
    "IMG": "Imagine",
    "VID": "Videoclip",
    "DW": "Descarcă",
    "DW_ALL": "Descarcă toate resursele",
    "THUMBNAIL_INTRO": "Descarcă miniatura videoclipului",
    "LOAD_BLOB_ONE": "Se încarcă conținutul media în format Blob...",
    "LOAD_BLOB_MULTIPLE": "Se încarcă conținutul media în format Blob și celelalte...",
    "LOAD_BLOB_RELOAD": "Se detectează conținutul media în format Blob, se reîncarcă acum...",
    "NO_CHECK_RESOURCE": "Trebuie să bifezi resursa pentru a o descărca.",
    "NO_VID_URL": "Nu se poate găsi URL-ul videoclipului.",
    "SETTING": "Setări",
    "AUTO_RENAME": "Redenumește automat fișierele (Click dreapta pentru a seta)",
    "RENAME_PUBLISH_DATE": "Setează marcajul de timp al fișierelor redenumite la data publicării resurselor",
    "RENAME_LOCATE_DATE": "Modifică formatul de dată al marcajului de timp pentru fișierele redenumite (Click dreapta pentru a seta)",
    "DISABLE_VIDEO_LOOPING": "Dezactivează redarea automată în buclă a videoclipurilor",
    "HTML5_VIDEO_CONTROL": "Afișează controllerul video HTML5",
    "REDIRECT_CLICK_USER_STORY_PICTURE": "Redirecționează când dai click pe fotografia profilului în storyul utilizatorului",
    "FORCE_FETCH_ALL_RESOURCES": "Forțează preluarea tuturor resurselor din postare",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE": "Descarcă direct resursele vizibile din postare",
    "DIRECT_DOWNLOAD_ALL": "Descarcă direct toate resursele din postare",
    "MODIFY_VIDEO_VOLUME": "Modifică volumul videoclipurilor (Click dreapta pentru a seta)",
    "DIRECT_DOWNLOAD_STORY": "Descarcă direct toate resursele din storyuri/highlighturi",
    "MODIFY_RESOURCE_EXIF": "Modifică proprietățile EXIF ale resurselor",
    "SCROLL_BUTTON": "Activează butoanele de derulare pentru pagina Reels",
    "FORCE_RESOURCE_VIA_MEDIA": "Forțează preluarea resurselor prin intermediul Media API",
    "FALLBACK_TO_BLOB_FETCH_IF_MEDIA_API_THROTTLED": "Folosește metode alternative pentru a descărca atunci când Media API nu este accesibil",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST": "„Deschide într-o filă nouă” în postări folosește întotdeauna Media API",
    "SKIP_VIEW_STORY_CONFIRM": "Omite pagina de confirmare la vizualizarea unui story/highlight",
    "AUTO_RENAME_INTRO": "Redenumește automat fișierele într-un format personalizat\nListă de formaturi personalizate: \n%USERNAME% - Numele de utilizator\n%SOURCE_TYPE% - Tipul sursei\n%SHORTCODE% - Codul scurt al postării\n%YEAR% - Anul descărcării/publicării\n%2-YEAR% - Anul (ultimele două cifre) descărcării/publicării\n%MONTH% - Luna descărcării/publicării\n%DAY% - Ziua descărcării/publicării\n%HOUR% - Ora descărcării/publicării\n%MINUTE% - Minutul descărcării/publicării\n%SECOND% - Secunda descărcării/publicării\n%ORIGINAL_NAME% - Numele original al fișierului descărcat\n%ORIGINAL_NAME_FIRST% - Numele original al fișierului descărcat (prima parte a numelui)\n\nDacă este setat pe fals, numele fișierului va rămâne neschimbat.\nExemplu: instagram_321565527_679025940443063_4318007696887450953_n.jpg",
    "RENAME_PUBLISH_DATE_INTRO": "Setează marcajul de timp în formatul de redenumire a fișierelor la data publicării resurselor (fusul orar al browserului)\n\nFuncționează DOAR dacă setarea [Redenumește automat fișierele] este pe ADEVĂRAT.",
    "RENAME_LOCATE_DATE_INTRO": "Modifică formatul de dată al marcajului de timp pentru redenumirea fișierelor la ora locală a browserului și formatează-l la formatul regional de dată dorit.\n\nFuncționează DOAR dacă setarea [Redenumește automat fișierele] este pe ADEVĂRAT.",
    "DISABLE_VIDEO_LOOPING_INTRO": "Dezactivează redarea automată în buclă a videoclipurilor din Reels și Postări.",
    "HTML5_VIDEO_CONTROL_INTRO": "Afișează controlerul video HTML5 în resursa video.\n\nAcest lucru va ascunde glisorul personalizat de volum video și îl va înlocui cu controlerul HTML5. Controlerul HTML5 poate fi ascuns făcând clic dreapta pe video pentru a dezvălui detaliile originale.",
    "REDIRECT_CLICK_USER_STORY_PICTURE_INTRO": "Redirecționează către pagina de profil a unui utilizator când dai click dreapta pe avatarul acestuia în zona dedicată storyurilor de pe pagina principală.\nDacă folosești butonul din mijloc pentru a da click, se va deschide într-o filă nouă.",
    "FORCE_FETCH_ALL_RESOURCES_INTRO": "Forțează preluarea tuturor resurselor (fotografii și videoclipuri) dintr-o postare prin intermediul API-ului Instagram pentru a elimina limita de trei resurse per postare.",
    "DIRECT_DOWNLOAD_VISIBLE_RESOURCE_INTRO": "Descarcă direct resursele actuale din postare.",
    "DIRECT_DOWNLOAD_ALL_INTRO": "Atunci când apeși butonul de descărcare, toate resursele din postare vor fi direct forțate să fie preluate și descărcate.",
    "MODIFY_VIDEO_VOLUME_INTRO": "Modifică volumul redării videoclipurilor în Reels și Postări (click dreapta pentru a deschide cursorul de setare a volumului).",
    "SCROLL_BUTTON_INTRO": "Activează butoanele de derulare pentru colțul din dreapta jos al paginii Reels.",
    "FORCE_RESOURCE_VIA_MEDIA_INTRO": "Media API va încerca să obțină cea mai înaltă calitate posibilă pentru fotografii sau videoclipuri, dar încărcarea va dura mai mult.",
    "FALLBACK_TO_BLOB_FETCH_IF_MEDIA_API_THROTTLED_INTRO": "Când Media API atinge limita de rată sau nu poate fi folosit din alte motive, Forced Fetch API este folosit pentru a descărca resursele (calitatea resurselor este puțin mai scăzută).",
    "NEW_TAB_ALWAYS_FORCE_MEDIA_IN_POST_INTRO": "Butonul [Deschide într-o filă nouă] în postări va folosi întotdeauna Media API pentru a obține resursele la rezoluție înaltă.",
    "SKIP_VIEW_STORY_CONFIRM_INTRO": "Omite automat când pagina de confirmare este afișată în story sau highlight.",
    "MODIFY_RESOURCE_EXIF_INTRO": "Modifică proprietățile EXIF ale resurselor de tip imagine pentru a plasa linkul postării în acesta.",
    "DIRECT_DOWNLOAD_STORY_INTRO": "Când dai click pe „Descarcă toate resursele”, toate storyurile/highlighturile sunt descărcate direct, fără a afișa caseta de dialog de selectare a resurselor."
}